In [1]:
import pandas
import matplotlib.pyplot as plt

enade2017=pandas.read_csv("../../MICRODADOS_ENADE_2017.txt", sep=';',dtype={"DS_VT_ESC_OFG": str, 
                                                                               'DS_VT_ESC_OCE':str,
                                                                              'DS_VT_ACE_OCE':str,
                                                                              'NT_GER':str,
                                                                              'NT_FG':str,
                                                                              'NT_OBJ_FG':str,
                                                                              'NT_DIS_FG':str,
                                                                              'NT_CE':str,
                                                                              'NT_OBJ_CE':str,
                                                                              'NT_DIS_CE':str})
print(enade2017.shape)

(537436, 150)

In [5]:
print(enade2017.columns)

Index(['NU_ANO', 'CO_IES', 'CO_CATEGAD', 'CO_ORGACAD', 'CO_GRUPO', 'CO_CURSO',
       'CO_MODALIDADE', 'CO_MUNIC_CURSO', 'CO_UF_CURSO', 'CO_REGIAO_CURSO',
       ...
       'QE_I72', 'QE_I73', 'QE_I74', 'QE_I75', 'QE_I76', 'QE_I77', 'QE_I78',
       'QE_I79', 'QE_I80', 'QE_I81'],
      dtype='object', length=150)

In [16]:
tabela = pandas.DataFrame(enade2017, columns=['NT_GER', 'CO_GRUPO', 'CO_IES', 'QE_I04', 'QE_I05', 'QE_I08', 'QE_I12'])
tabela.head(10)

  NT_GER  CO_GRUPO  CO_IES QE_I04 QE_I05 QE_I08 QE_I12
0   52,6      5710       1      D      F      B      A
1   63,1      5710       1      E      D      B      A
2   33,7      5710       1      E      F      F      A
3   58,1      5710       1      D      D      B      A
4   46,3      5710       1      D      F      F      A
5   64,2      5710       1      B      B      C      A
6   41,4      5710       1      D      D      C      E
7   48,8      5710       1      D      E      C      A
8   52,9      5710       1      E      F      E      A
9   62,7      5710       1      D      D      C      A

In [17]:
##limpeza dos dados

#substitui vírgula por ponto
tabela['NT_GER'] = tabela['NT_GER'].str.replace(',', '.')

tabela=tabela.loc[(tabela['NT_GER'].notnull())]
#print(tabela['NT_GER'])
#converte de str para float
tabela['NT_GER'] = pandas.to_numeric(tabela['NT_GER'])

tabela['NT_GER'].describe()

count    449932.000000
mean         43.523969
std          14.080110
min           0.000000
25%          33.400000
50%          42.900000
75%          53.100000
max          98.100000
Name: NT_GER, dtype: float64

In [18]:
#Calcula a média de um curso especifico
#Código da área de enquadramento do curso no Enade == ciencia da computacao

ccomp = tabela[tabela['CO_GRUPO']==4004]

#print(ccomp)
ccomp['NT_GER'].describe()

count    8489.000000
mean       43.262775
std        13.633212
min         0.000000
25%        33.700000
50%        42.300000
75%        52.400000
max        95.100000
Name: NT_GER, dtype: float64

In [15]:
#do curso do IFNMG
ifccomp = ccomp[ccomp['CO_IES']==3188]
ifccomp.describe()

          NT_GER  CO_GRUPO  CO_IES
count   6.000000       6.0     6.0
mean   52.883333    4004.0  3188.0
std     8.564442       0.0     0.0
min    40.300000    4004.0  3188.0
25%    48.325000    4004.0  3188.0
50%    53.450000    4004.0  3188.0
75%    58.875000    4004.0  3188.0
max    62.800000    4004.0  3188.0

In [19]:
#somente as notas de quem respondeu a questão sobre auxilio permanencia
'''
12. Ao longo da sua trajetória acadêmica, você recebeu algum tipo de auxílio permanência? No caso de haver
mais de uma opção, marcar apenas a bolsa de maior duração.
A ( ) Nenhum.
B ( ) Auxílio moradia.
C ( ) Auxílio alimentação.
D ( ) Auxílio moradia e alimentação.
E ( ) Auxílio permanência.
F ( ) Outro tipo de auxílio.
'''
ccomp=ccomp.loc[(ccomp['QE_I12'].notnull())]
ccomp.NT_GER.describe()

count    8408.000000
mean       43.324619
std        13.626419
min         0.000000
25%        33.800000
50%        42.300000
75%        52.500000
max        95.100000
Name: NT_GER, dtype: float64

In [ ]:
import matplotlib.pyplot as plt
#visualmente
plt.scatter( ccomp.NT_GER, ccomp.QE_I08)
plt.ylabel('Auxilio de maior duração')
plt.xlabel('Nota do curso de C. da Comp.')
plt.show()